#Составьте программу, которая запрашивает название государства и его столицы, а затем выводит сообщение:
# Государство - ..., столица - ...
# На месте многоточий должны быть выведены соответствующие значения.
country = input('Введите название страны: ')
city = input('Введите название города: ')
print(f'Государство - {country}, столица - {city}')